# texts.py

info_jordan = (
    "Описание продукта:\n\n"
    "Jordan 4 Retro OG SP A Ma Maniére While You Were Sleeping (женская) — это последнее дополнение к продолжающемуся сотрудничеству "
    "Jordan Brand и A Ma Maniére, известных сочетанием роскошных материалов с вневременным дизайном. "
    "Этот релиз отличается верхом из высококачественной замши и кожи из окаменелого камня, что создает изысканный, но в то же время смелый образ. "
    "Контрастные черные акценты на межподошве добавляют глубину дизайну, а на язычке одной пары кроссовок изображена культовая бирка Jumpman, а на другой — логотип A Ma Maniére."
)

info_asics = (
    "Описание продукта\n\n"
    "ASICS Gel-1130 White Black — это кроссовки для бега с дизайном, уходящим корнями в технические беговые кроссовки начала 2000-х годов.\n\n"
    "Версия ASICS Gel-1130 «White Black» черпает вдохновение в GEL-KAYANO 14 и девятой итерации серии GEL-1000. "
    "Хотя модель была впервые представлена ​​в 2008 году, эта версия имеет полностью белую основу с черными и серебристыми акцентами. "
    "Верх выполнен из легкой сетки со свободным плетением, что придает кроссовкам ощущение воздушности. "
    "Накладки из синтетической кожи пересекают сетчатую основу и вносят вклад в технический силуэт обуви. "
    "С точки зрения технологии, гелевая амортизация в пятке снижает ударную нагрузку, не утяжеляя обувь. "
    "Фирменная система поддержки ASICS TRUSSTIC также улучшает устойчивость и является возвратом к началу 2000-х годов."
)

info_nike_vomero = (
    "Описание продукта\n\n"
    "Кроссовки Nike Zoom Vomero 5 Photon Dust Metallic Silver (W) выпускаются в следующих цветовых гаммах: Photon Dust, Chrome, Gridiron и Sail. "
    "Кроссовки имеют верх из воздухопроницаемой ткани, что обеспечивает воздухопроницаемость и комфорт. "
    "В кроссовках используется технология амортизации Zoom Air от Nike, которая обеспечивает отзывчивую амортизацию с возвратом энергии. "
    "Кроссовки также оснащены мягкой и поддерживающей подошвой из мягкой пены. "
    "Кроссовки оснащены фиксатором пятки из термополиуретана, который обеспечивает устойчивость и снижает риск скольжения. "
    "Прочная резиновая подошва кроссовок имеет вафельный рисунок для сцепления. "
    "Кроссовки украшены логотипом Nike Swoosh по бокам, надписью «NIKE VOMERO 5» на язычке и небольшим логотипом Swoosh на пятке."
)

info_kobe_5 = (
    "Описание продукта\n\n"
    "Nike Kobe 5 Protro X-Ray — это яркая дань уважения легендарной карьере Коби Брайанта, вдохновленная культовой футболкой X-ray, на которой была изображена его рука, украшенная пятью чемпионскими кольцами. "
    "Переосмысливая эту концепцию, дизайн X-ray нанесен на верхнюю часть Kobe 5 с элементами, светящимися в темноте, изображающими рентгеновский снимок стопы. "
    "Выполненные в глубоком королевском синем, балтийском синем и ледниковом синем цветах, эти смелые кроссовки также имеют светящуюся в темноте подошву, что добавляет дополнительный слой изюминки и без того поразительному силуэту."
)

info_adidas = (
    "Описание продукта\n\n"
    "Adidas AE 1 Ascent добавляет гладкую цветовую гамму Charcoal и Core Black к первым фирменным кроссовкам игрока NBA Энтони Эдвардса с adidas.\n\n"
    "Средняя по высоте модель Ascent adidas AE 1 установлена ​​на легкой подошве Jet Boost и LightStrike с покрытием из ТПУ, которая находит поддержку в полноразмерной торсионной пластине. "
    "В то время как верх изготовлен из плотно сплетенной сетки, боковые панели из ТПУ с сотовой конструкцией поддерживают обувь и позволяют ноге дышать. "
    "Боковые панели из ТПУ также имеют мраморный рисунок в цвете Charcoal, который выделяет «Ascent» среди других моделей adidas AE 1. "
    "Прорезиненный логотип с тремя полосками украшает формованную заднюю часть пятки."
)

info_kobe9 = (
    "Описание продукта\n\n"
    "Nike Kobe 9 Elite Protro Halo — это ангельская дань уважения покойной легенде НБА Коби Брайанту, выпущенная в его день рождения 24 августа.\n\n"
    "Белый цвет доминирует в конструкции кроссовок и символизирует переход Коби на небеса. "
    "Кроссовки могут похвастаться привлекательным высоким дизайном с легким верхом Flyknit вместо традиционного кожаного. "
    "Flyknit обеспечивает ощущение фиксации и является прочным, но гибким. "
    "Добавление технологии Nike React в промежуточную подошву обеспечивает большую отзывчивость, а подошва разработана так, чтобы имитировать естественные движения стопы."
)

info_luivit = (
    "Основные характеристики:\n\n"
    "Кроссовки LV Trainer (RED) от Louis Vuitton выполнены из белой кожи с ярко-красной окантовкой и деталями, имеют фирменную монограмму дома на белой коже и на подошве, "
    "фирменную символику LV и стельки с двойной маркировкой."
)

info_dunkk = (
    "Описание продукта\n\n"
    "Nike SB Dunk Low White Lobster (Friends and Family) — редкий и очень желанный релиз от продолжающегося партнерства Nike с бостонским бутиком Concepts. "
    "Известный своей легендарной серией «Lobster», Concepts доставил эту белую и фотонную пыльную версию эксклюзивно друзьям и семье, что сделало ее одной из самых востребованных пар в линейке SB Dunk."
)

info_skulon = (
    "Описание продукта\n\n"
    "Джерри Лоренцо не закончил работать с Nike, и теперь горячий дуэт объединился, чтобы выпустить Air Skylon 2 Fear of God White. "
    "Эти Air Skylon 2 имеют белый верх, черный логотип Nike «Swoosh», белую межподошву и белую подошву."
)
